<!DOCTYPE html>
<html ng-app="myApp">
<head lang="en">
    <meta charset="UTF-8">
    <title></title>

    <style>
        h1{
            text-align: center;
        }
        h3{
            text-indent:5px;
        }
        p{
            text-indent:30px;

        }
    </style>
</head>
<body>
<h1>OPPO帐号注册协议</h1>
<div ng-controller="myCtrl">

    <h3> 1、OPPO帐号使用协议的接受</h3>
    <p>
        1.1  通过访问或使用OPPO帐号，您表示同意接受本协议的所有条件和条款。OPPO帐号的运营者依据本协议为您提供服务。如果您不愿接受本协议的全部条件和条款，请您不要访问或使用OPPO帐号。本协议一经同意并接受，即形成您与东莞讯怡电子科技有限公司及其关联公司（以下简称“东莞讯怡”）间有法律约束力之文件。您确认，您已详细阅读了本协议所有内容，您充分理解并同意接受本协议的全部内容。
    </p>
   公司（以下简称“东莞讯怡”）间有法律约束力之文件。您确认，您已详细阅读了本协议所有内容，您充分理解并同意接受本协议的全部内容。

    <h3>2、本协议的变更和修改</h3>

    2.1  OPPO帐号有权随时对本协议进行修改，并且一旦发生协议条款的变动，将在相关页面上提示修改的内容；用户如果不同意本协议的修改，可以放弃使用或访问OPPO帐号或取消已经获得的服务；如果用户选择在本协议变更后继续访问或使用OPPO帐号，则视为用户已经接受本协议的修改。

   <h3>3、服务说明</h3>

    3.1  如果您从本站下载软件，在使用软件时要遵守该软件附带的软件许可协议中所有的许可条款。在您阅读并接受软件许可协议的各项条款之前，不得下载或安装这一软件。如果在适用的许可条款或协议中，已经禁止复制或再分发这些软件，您须遵照执行。
    3.2  OPPO帐号运用自己的系统通过互联网向用户提供服务，除非另有明确规定，增强或强化目前服务的任何新功能，包括新产品以及新增加的服务，均无条件地适用本协议。
    3.3  OPPO帐号对网站服务不承担任何责任，公司不保证服务一定会满足用户的使用要求，也不保证服务不会被中断，对服务的及时性、安全性、准确性也不作担保。
    3.4  本站到第三方网站的链接仅作为一种方便服务提供给您。如果使用这些链接，您将离开本站，且OPPO帐号没有责任审查任何第三方网站，因此对这些网站及其内容不进行控制，也不负任何责任。如果您决定访问任何与本站链接的第三方网站，其可能带来的结果和风险全部由您自己承担。

   <h3>4、用户行为</h3>

    4.1  用户帐号、密码和安全
    4.1.1  用户不得恶意注册OPPO帐号。OPPO可以对恶意注册行为进行独立判断和处理。对于恶意注册所产生的帐号，OPPO有权予以关闭。
    4.1.2  用户一旦注册成功，便成为OPPO帐号的合法用户。用户应采取合理措施维护其密码和帐号的安全。用户对利用该密码和帐号所进行的一切活动负全部责任；由该等活动所导致的任何损失或损害由用户承担，OPPO帐号不承担任何责任。
    4.1.3  如果用户的密码和帐号遭到未授权的使用或发生其他任何安全问题，用户可以立即通知OPPO帐号。对于用户长时间未使用的帐号，OPPO帐号有权予以关闭。
    4.1.4  帐号属初始注册人所有，用户不得赠与、借用、租用、转让或售卖OPPO帐号，以免引起纠纷。用户应当自行承担由此产生的任何责任，同时OPPO保留追究上述行为人法律责任的权利。
    4.2  用户应遵守以下法律及法规
    4.2.1  用户同意遵守《中华人民共和国保守国家秘密法》、《中华人民共和国著作权法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《互联网电子公告服务管理规定》、《信息网络传播权保护条例》等有关计算机及互联网规定的法律、法规、实施办法。在任何情况下，如果OPPO帐号合理地认为用户的行为可能违反上述法律、法规，OPPO帐号可以在任何时候，不经事先通知终止向该用户提供服务。
    4.2.2  OPPO帐号欢迎用户举报任何违反上述法律或侵犯他人权利的上传内容，一经发现违法或侵权的上传内容，OPPO帐号将无条件删除。
    4.3  禁止用户从事以下行为
    4.3.1  上载、张贴、发送电子邮件或传送包含任何反对宪法所确定的基本原则、危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一、破坏民族团结、损害国家荣誉和利益、煽动民族仇恨、民族歧视、破坏民族团结、破坏国家宗教政策、宣扬邪教和封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪、侮辱或者诽谤他人、侵害他人合法权益等法律、行政法规禁止的内容或其他令人反感的包括但不限于资讯、资料、文字、软件、音乐、照片、图形、信息或其他资料（以下简称内容）。
    4.3.2  以任何方式危害未成年人。
    4.3.3  冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关。
    4.3.4  伪造标题或以其他方式操控识别资料，使人误认为该内容为OPPO帐号所传送。
    4.3.5  将无权传送的内容（例如内部资料、机密资料）进行上载、张贴、发送电子邮件或以其他方式传送。
    4.3.6  将侵犯任何人的专利、商标、著作权、商业秘密或其他专属权利之内容加以上载、张贴、发送电子邮件或以其他方式传送。
    4.3.7  将广告函件、促销资料、垃圾邮件等，加以上载、张贴、发送电子邮件或以其他方式传送，其中，供前述目的使用的专用区域除外。
    4.3.8  将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序的资料，加以上载、张贴、发送电子邮件或以其他方式传送。
    4.3.9  干扰或破坏OPPO帐号服务或与OPPO帐号服务相连的服务器和网络，或不遵守OPPO帐号的使用规定。
    4.3.10  故意或非故意违反任何相关的中国法律、法规、规章、条例等其他具有法律效力的规范。
    4.4  用户对经由OPPO帐号上载、张贴、发送电子邮件或传送的内容承担全部责任对于经由OPPO帐号而传送的内容，OPPO帐号不保证前述其合法性、正当性、准确性、完整性或品质。用户在接受OPPO帐号服务时，有可能会接触到令人不快、不适当或令人厌恶的内容。在任何情况下，OPPO帐号均不对任何内容承担任何责任，包括但不限于任何内容发生任何错误或纰漏以及衍生的任何损失或损害。OPPO帐号有权（但无义务）自行拒绝或删除经由OPPO帐号提供的任何内容。用户使用上述内容，应自行承担风险。OPPO帐号有权利在下述情况下，对内容进行保存或披露：
    4.4.1  法律程序所规定；
    4.4.2  本服务使用协议规定；
    4.4.3  被侵害的第三人提出权利主张；
    4.4.4  为保护本公司、其使用者及社会公众的权利、财产或人身安全。
    4.4.5  其他本公司认为有必要的情况。
    4.5  对用户信息的存储和限制
    4.5.1  OPPO帐号不对用户所发布信息的删除或储存失败承担责任。OPPO帐号有权判断用户的行为是否符合OPPO帐号使用协议条款之规定，如果OPPO帐号认为用户违背了协议条款的规定，OPPO帐号有终止向其提供网站服务的权利。

   <h3> 5、用户隐私权制度</h3>

    5.1  当用户注册本服务时，用户须提供个人信息。OPPO帐号收集个人信息的目的是为用户提供尽可能多的个人化网上服务以及为广告商提供一个方便的途径来接触到适合的用户，并且可以发送具有相关性的内容和广告。在此过程中，广告商绝对不会接触到用户的个人信息。OPPO帐号不会在未经合法用户授权时，公开、编辑或透露其个人信息及其保存在本公司中的非公开内容，除非有下列情况：
    5.1.1  有关法律规定或本公司合法服务程序规定；
    5.1.2  在紧急情况下，为维护用户及公众的权益；
    5.1.3  为维护本公司的商标权、专利权及其他任何合法权益；
    5.1.4  其他需要公开、编辑或透露个人信息的情况。

   <h3> 6、关于可币</h3>
    <p>
        6.1  可币使用规则 <br/>
        6.1.1  可币是购买ColorOS平台上虚拟商品的预付费凭证，只可用于购买ColorOS平台上的各种虚拟产品和增值服务（如游戏、主题、电子书等）。可币和人民币的兑换比例是1:1。 <br/>
        6.1.2  可币充值就是用人民币购买可币。您可以选择为自己充值，也可以选择为他人充值，充值成功后可用可币消费。您必须采用东莞讯怡公司指定的充值方式进行充值，以增加您帐户所拥有的可币数量，可供充值方式包括但不限于：网上银行、第三方支付（例如支付宝、财付通等）、手机充值卡。 <br/>
        6.1.3  您知晓并确认，您仅可以通过官方渠道充值，不购买来源不明的可币，来源不明的可币充值可能是伪造、通过盗打电话、使用运营商黑卡盗刷、冒用他人帐号获得。东莞讯怡公司有权对通过非正常途径充值的可币帐户进行冻结。东莞讯怡公司保留向通过盗打电话、冒充、盗用他人身份或者帐号等非正常途径充值可币的单位或个人追究法律责任的一切权力。 <br/>
        6.1.4  您知晓并确认，可币充值一旦成功，购买即确定完成（可开具发票）。您不得要求退还虚拟商品，除非商品本身无法使用。 <br/>
        6.1.5  您知晓并确认，未使用的可币会进入可币帐户，东莞讯怡公司终止运营或者运营权发生转移的，应到提前60日予以公告。用户尚未使用的可币及尚未失效的服务，应当按用户购买时的比例，以法定货币退还用户或者用户接受的其他方式进行退还。 <br/>
        6.1.6  您知晓并确认，在使用可币充值系统时，您必须仔细确认充值帐号，若因为您自身输入帐号错误、操作不当或不了解充值计费方式等个人因素造成充错帐号、错选充值金额等情形而损害自身权益，您不得因此要求东莞讯怡公司作任何补偿或赔偿。若因充值系统原因造成您充值失实，在您提供合法有效凭证的情况下，造成可币充值额小于您实际充值额的，东莞讯怡公司予以补其差额，若大于您实际充值额的，东莞讯怡公司有权追回差额。 <br/>
        6.1.7  您知晓并确认， 东莞讯怡的账号和密码，请妥善保管好您的密码。当您的帐户遇到争议时（例如挂失或重置密码），我们有权根据您的注册和绑定信息对您的身份进行识别。但在目前的技术水平下，我们所能采取的方法有限，且在网络上进行用户身份识别存在一定的困难，因此，我们对鉴定用户身份的准确性和绝对真实性不做任何保证。 <br/>
        6.1.8  您可以凭注册信息及注册联系方式联系客服挂失冻结帐户，但如因您本人的挂失时间延迟，而导致此期间内发生消费或充值损失，我们不予赔偿。 <br/>
        6.2  免责事由，您知悉并同意，东莞讯怡公司不因下述任一情况而可能导致的任何损害赔偿承担责任，包括但不限于财产、收益、数据资料等方面的损失或其它无形损失： <br/>
        6.2.1  因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素导致东莞讯怡充值系统或服务不能正常运作。 <br/>
        6.2.2  由于黑客攻击、电信部门技术调整或故障、系统维护等原因而造成的系统服务中断或者延迟。 <br/>
        6.2.3  由于政府命令、法律法规的变更、司法机关及行政机关的命令、裁定等原因而导致的系统服务中断、终止或延迟。 <br/>
        6.2.4  由于您将帐户密码告知他人或未保管好自己的密码或与他人共享帐户或任何其他非本公司的过错，导致您的个人资料泄露。 <br/>
        6.2.5  由于与本公司链接或合作的其它网站（如网上银行等）所造成的银行帐户信息、身份信息泄露及由此而导致的任何法律争议和后果。 <br/>
        6.2.6  您（包括未成年人用户）向本公司提供错误、不完整、不实信息等，造成不能使用可币帐户或遭受任何其他损失。 <br/>
        6.2.7  如因系统维护或升级的需要而需暂停网络充值服务时，我们将尽可能事先进行通告。对于充值服务的中断或终止而给您造成的任何损失，我们无须对您或任何第三方承担任何责任。 <br/>
    </p>

。
    <h3>7、关于用户在OPPO帐号上载或发布的内容</h3>

    7.1  用户上载的内容是指用户在OPPO帐号上载或发布的视频或其它任何形式的内容包括文字、图片、软件等。
    7.2  除非本公司收到相关通知，本公司将用户视为其在OPPO帐号上载或发布的内容的版权拥有人。用户在OPPO帐号上载或发布内容即视为其同意授予OPPO帐号所有上述内容在全球范围内的免费、不可撤销的无限期的并且可转让的非独家使用权许可，OPPO帐号有权展示、散布及推广前述内容，有权对前述内容进行任何形式的复制、修改、出版、发行及以其他方式使用或者授权第三方进行复制、修改、出版、发行及以其他方式使用。
    7.3  因用户进行上述内容在OPPO帐号的上载或发布，而导致任何第三方提出索赔要求或衍生的任何损害或损失，由用户承担全部责任。

    <h3>8、关于第三方链接</h3>

    8.1  OPPO帐号服务可能会提供与其他国际互联网网站或资源进行链接。因使用或依赖上述网站或资源所生的损失或损害，本公司不负担任何责任。

    <h3>9、本公司的知识产权及其他权利</h3>

    9.1  本公司对网站服务及OPPO帐号所使用的软件所包含的受知识产权或其他法律保护的资料享有相应的权利；除用户依法享有之版权之内容之外，OPPO帐号的整体内容版权归本公司所有。
    9.2  经由OPPO帐号传送的视频及其它内容，受到著作权法、商标法、专利法或其他法律的保护；除该等视频及其它内容上载的用户所享有的版权，未经本公司明示授权许可，其他用户不得进行修改、出租、散布或衍生其他作品。
    9.3  OPPO帐号所有设计图样以及其他图样、产品及服务名称，均为本公司或其关联公司所享有的商标、标识。任何人不得使用、复制或用作其他用途。

   <h3>10、关于用户权限的许可范围</h3>

    10.1  OPPO帐号就许可应用程序向您授予的此项使用许可为一项不可转让的许可，范围仅限于按照本条款与条件规定的条件下在由您拥有或控制的任何运行Android的设备上使用许可应用程序。本许可不允许您在不由您拥有或控制的移动设备上使用许可应用程序，而且除非使用规则中另有规定，您不得在网络上分发或提供许可应用程序，以致许可应用程序在同一时间可供多个设备使用。您不得对许可应用程序进行出租、租赁、出借、出售、转让、再分发或再许可，并且当您向第三方出售您的终端产品时，您必须在出售前从终端产品中移除许可应用程序。您不得对许可应用程序、任何更新或其任何部分进行拷贝、反编译、反向工程、反汇编、修改，试图导出其源代码或制造其衍生作品（但适用法律禁止任何前述限制，或适用于许可应用程序所含的任何开放源组件的使用的许可条款允许的情形除外）。凡试图进行上述任何行为均属违反OPPO帐号和其许可方的权利。如您违反本限制，您可能会被追究责任及须作出赔偿。
    10.2  该许可条款将适用于许可商提供的任何替代或补充原许可应用程序的升级程序，除非该等升级程序附有单独的许可，在此情况下该许可的条款将予适用。

    <h3>11、免责声明</h3>

    11.1  OPPO帐号对于任何自OPPO帐号而获得的他人的信息、内容或者广告宣传等任何资讯（以下统称“信息”），不保证真实、准确和完整性。如果任何单位或者个人通过上述“信息”而进行任何行为，须自行甄别真伪和谨慎预防风险，否则，无论何种原因，OPPO帐号不对任何非与OPPO帐号直接发生的交易或行为承担任何直接、间接、附带或衍生的损失和责任。
    11.2  有权但无义务，改善或更正OPPO帐号任何部分之任何疏漏、错误。
    11.3  不保证（包括但不限于）：
    11.3.1  OPPO帐号适合用户的使用要求；
    11.3.2  OPPO帐号不受干扰，及时、安全、可靠或不出现错误；
    11.3.3  用户经由OPPO帐号取得的任何产品、服务或其他材料符合用户的期望。
    11.4  用户使用经由OPPO帐号下载的或取得的任何资料，其风险自行负担；因该等使用导致用户手机系统损坏或资料流失，用户应负完全责任；
    11.5  基于以下原因而造成的利润、商业信誉、资料损失或其他有形或无形损失，不承担任何直接、间接、附带、衍生或惩罚性的赔偿：
    11.5.1  OPPO帐号使用或无法使用；
    11.5.2  经由OPPO帐号购买或取得的任何产品、资料或服务；
    11.5.3  用户资料遭到未授权的使用或修改；
    11.5.4  其他与OPPO帐号相关的事宜。
    11.6  用户在浏览互联网时自行判断使用OPPO帐号的搜索或检索目录。该搜索或检索目录可能会引导用户进入到被认为具有攻击性或不适当的网站，没有义务查看检索目录所列网站的内容，因此，对其正确性、合法性、正当性不负任何责任。

   <h3>12、第三方责任</h3>

    12.1  由于用户经由OPPO帐号上载或发布内容、与OPPO帐号连线、违反本服务条款或侵害其他人的任何权利导致任何第三人提出权利主张，用户同意赔偿本公司及其分公司、关联公司、代理人或其他合作伙伴及员工，并使其免受损害。

   <h3>13、服务的终止</h3>

    13.1  OPPO帐号有权在任何时候，暂时或永久地终止OPPO帐号服务（或任何一部分），无论是否通知。对OPPO帐号服务的终止对用户和任何第三人不承担任何责任。OPPO帐号有权基于任何理由，终止用户的帐号、密码或使用本服务，或删除、转移用户存储、发布在本服务的内容，本公司采取上述行为均不需通知，并且对用户和任何第三人不承担任何责任。

    <h3>14、通知</h3>

    14.1  OPPO帐号向用户发出的通知，采用电子邮件或页面公告的形式。本协议条款的修改或其他事项变更时，OPPO帐号将会以上述某一形式进行通知。

    <h3>15、法律的适用和管辖</h3>

    15.1  本使用协议的生效、履行、解释及争议的解决均适用中华人民共和国法律，与本协议有关的争议提交由本公司所在地的法院管辖。即便
    本服务条款因与中华人民共和国现行法律相抵触而导致部分无效，也不影响其他部分的效力。

</div>
<form action="">
    <input type="checkbox" ng-model="isagree" checked="checked"/> 是否同意 <br/>
    <a href="register.php"><input type="button" value="确定" id="bt-submit"/></a>
</form>
<script src="js/jquery-1.11.3.js"></script>
<script src="js/angular.js"></script>
<script>
    var app = angular.module('myApp',['ng']);
    app.controller('myCtrl',function($scope){

    });
    $('#bt-submit').click(function(){
        location.href='oppo_register.html';
    })
</script>
</body>
</html>